hongtiansun/My_notes/STM32/codes_标准库/模块代码/LED模块/LED.c
#include "stm32f10x.h"

void LED_Init(void){
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_1|GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	GPIO_SetBits(GPIOA,GPIO_Pin_1|GPIO_Pin_2);
}

void LED1_ON(){
	GPIO_ResetBits(GPIOA,GPIO_Pin_1);
}
void LED1_OFF(){
	GPIO_SetBits(GPIOA,GPIO_Pin_1);
}
void LED2_ON(){
	GPIO_ResetBits(GPIOA,GPIO_Pin_2);
}
void LED2_OFF(){
	GPIO_SetBits(GPIOA,GPIO_Pin_2);
}

void LED1_Turn(){
	if(GPIO_ReadOutputDataBit(GPIOA,GPIO_Pin_1)==0){
		GPIO_SetBits(GPIOA,GPIO_Pin_1);
	}
	else{
		GPIO_ResetBits(GPIOA,GPIO_Pin_1);
	}
}
void LED2_Turn(){//疑惑？？？
	if(GPIO_ReadOutputDataBit(GPIOA,GPIO_Pin_2)==0){
		GPIO_SetBits(GPIOA,GPIO_Pin_2);
	}
	if(GPIO_ReadOutputDataBit(GPIOA,GPIO_Pin_2)==1){
		GPIO_ResetBits(GPIOA,GPIO_Pin_2);
	}
}